Tekla Open API Reference for Tekla Structures 2025
View.LabelLineLengthType Enumeration
 The label line length types.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LabelLineLengthType
Public Enumeration LabelLineLengthType
Members
Member name | Value | Description
Minimal | 1 |  The label is of minimal possible length according to the label text.
Custom | 2 |  The label is of custom length.
See Also
Reference
Tekla.Structures.Drawing Namespace